In [ ]:
import numpy as np
import pandas as pd

In [ ]:
tsunami_data = pd.read_csv("tsunami-earthquake.csv")

In [ ]:
tsunami_data = tsunami_data[['FLAG_TSUNAMI', 'MONTH', 'DAY', 'LATITUDE', 'LONGITUDE', 'DEATHS',]]
tsunami_data.head()

  FLAG_TSUNAMI  MONTH  DAY LATITUDE LONGITUDE  DEATHS
0           No    NaN  NaN     31.1      35.5     NaN
1          Yes    NaN  NaN   35.683      35.8     NaN
2           No    NaN  NaN       38      58.2     1.0
3          Yes    NaN  NaN     36.4      25.4     NaN
4           No    NaN  NaN     31.5      35.3     NaN

In [ ]:
tsunami_data = tsunami_data.replace(to_replace= ['Yes','No'],value = ['1','0'])

In [ ]:
tsunami_data.head()

  FLAG_TSUNAMI  MONTH  DAY LATITUDE LONGITUDE  DEATHS
0            0    NaN  NaN     31.1      35.5     NaN
1            1    NaN  NaN   35.683      35.8     NaN
2            0    NaN  NaN       38      58.2     1.0
3            1    NaN  NaN     36.4      25.4     NaN
4            0    NaN  NaN     31.5      35.3     NaN

In [ ]:
tsunami_data = tsunami_data[tsunami_data['FLAG_TSUNAMI'].notna()]
tsunami_data = tsunami_data[tsunami_data['MONTH'].notna()]
tsunami_data = tsunami_data[tsunami_data['DAY'].notna()]
tsunami_data = tsunami_data[tsunami_data['LATITUDE'].notna()]
tsunami_data = tsunami_data[tsunami_data['LONGITUDE'].notna()]
tsunami_data = tsunami_data[tsunami_data['DEATHS'].notna()]

In [ ]:
tsunami_data.head(10)

    FLAG_TSUNAMI  MONTH   DAY LATITUDE LONGITUDE    DEATHS
33             0    2.0  22.0     33.8     105.6     760.0
35             0    6.0   1.0     36.3       119    6000.0
73             1   12.0  13.0     36.1      36.1  260000.0
115            0   10.0  11.0     40.7      29.7    1000.0
143            0    5.0  21.0     39.4     113.3    5130.0
148            0    5.0  29.0    36.25      36.1  250000.0
150            0   11.0  29.0    36.25      36.1    4870.0
151            0   11.0  29.0     36.2      37.2  130000.0
154            1    7.0   7.0     38.4      22.3    5000.0
169            0    9.0  30.0    36.25      36.1   60000.0

In [ ]:
from sklearn.model_selection import train_test_split

X=tsunami_data.drop('FLAG_TSUNAMI', axis=1)  
y=tsunami_data.FLAG_TSUNAMI  

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [ ]:
from sklearn.ensemble import RandomForestRegressor

rf = RandomForestRegressor(n_estimators = 1000)

rf.fit(X_train, y_train);

In [ ]:
rf

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=1000, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [ ]:
y_pred = rf.predict(X_train)

In [ ]:
print("Mean Squared Error:",metrics.mean_squared_error(y_train, y_pred))

Mean Squared Error: 0.01793546493130875

In [ ]:
from joblib import dump, load
dump(rf, 'tsunami_model.joblib')

['tsunami_model.joblib']